                                                            ### Списки:

#1. **Робота із списками:**
   #Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.
lst = [1, 2, 3, 8]
lst.append(10)
lst.append(20)
print(lst)
lst.remove(10)
print(lst)

#2. **Знаходження суми:**
   #Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.

lst = [2, 6, 10, 12, 3]
a = lst[0]+lst[1]+lst[2]+lst[3]+lst[4]
print(a)

res = 0
for i in lst:
    res += i
print(res)


#3. **Подвійні значення:**
   #Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.
lst = [2, 6, 10, 12, 3]
a_lst = [2*lst[0], 2*lst[1], 2*lst[2], 2*lst[3],2*lst[4]]
print(a_lst)

a = []
for i in lst:
    a.append(2*i)
print(a)

                                                            ### Кортежі:

#1. **Робота із кортежами:**
#   Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин").
#   Виведіть кожен елемент кортежу окремо.

fruits = ("яблуко", "банан", "апельсин")
print(fruits[0])
print(fruits[1])
print(fruits[2])

#2. **Об'єднання кортежів:**
#   Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.
a = (1, 2, 3)
b = (3, 2, 1)
c = a + b
print(c)
                                                ### Словники:

#1. **Робота із словниками:**
 #  Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо).
 #  Виведіть цю інформацію на екран.

sportsman = {
    'name': 'Cristiano',
    'last_name': 'Ronaldo',
    'age': 39,
    'team': 'Al-Nasr'
}
name = sportsman['name']
last_name = sportsman['last_name']
age = sportsman['age']
team = sportsman['team']
print(name, last_name, age, team)

#2. **Оновлення словника:**
   #Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання).
    # Додайте до словника нову улюблену книгу та виведіть оновлений словник.

fav_books = {
    'book1': 'Atomic Habit, 2018',
    'book2': '1984, 1949',
    'book3': 'Do No Harm, 2014'
}
print(fav_books)

fav_books['book4'] = 'The Swordless Samurai, 2005'
print(fav_books)

#3. **Пошук значення:**
   #Завдання: Створіть словник, що містить інформацію про країни та їх столиці.
    # Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).

capitals = {
    'Україна': 'Київ',
    'США': 'Вашингтон',
    'Польща': 'Варшава',
    'Італія': 'Рим',
    'Франція': 'Париж'
}

x = input('Уведіть назву країни:')

if x in capitals.keys():
    print(f'Столиця країни {x}: {capitals[x]}')
else:
    print('Помилка, уведіть назву іншої країни')
